Desafio Clase 38/Tests/artillery_con.txt
Phase started: unnamed (index: 0, duration: 1s) 19:44:45(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 19:44:46(-0300)

--------------------------------------
Metrics for period to: 19:44:50(-0300) (width: 4.359s)
--------------------------------------

http.codes.500: ................................................................ 157
http.request_rate: ............................................................. 45/sec
http.requests: ................................................................. 196
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 1191
  median: ...................................................................... 572.6
  p95: ......................................................................... 1153.1
  p99: ......................................................................... 1176.4
http.responses: ................................................................ 157
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50


--------------------------------------
Metrics for period to: 19:45:00(-0300) (width: 9.892s)
--------------------------------------

http.codes.500: ................................................................ 472
http.request_rate: ............................................................. 46/sec
http.requests: ................................................................. 452
http.response_time:
  min: ......................................................................... 108
  max: ......................................................................... 1042
  median: ...................................................................... 671.9
  p95: ......................................................................... 963.1
  p99: ......................................................................... 1022.7
http.responses: ................................................................ 472


--------------------------------------
Metrics for period to: 19:45:10(-0300) (width: 7.068s)
--------------------------------------

http.codes.500: ................................................................ 371
http.request_rate: ............................................................. 51/sec
http.requests: ................................................................. 352
http.response_time:
  min: ......................................................................... 58
  max: ......................................................................... 1030
  median: ...................................................................... 871.5
  p95: ......................................................................... 963.1
  p99: ......................................................................... 1002.4
http.responses: ................................................................ 371
vusers.completed: .............................................................. 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 20291.9
  max: ......................................................................... 21336.1
  median: ...................................................................... 20958.1
  p95: ......................................................................... 21381.5
  p99: ......................................................................... 21381.5


All VUs finished. Total time: 23 seconds

--------------------------------
Summary report @ 19:45:07(-0300)
--------------------------------

http.codes.500: ................................................................ 1000
http.request_rate: ............................................................. 24/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 1191
  median: ...................................................................... 757.6
  p95: ......................................................................... 982.6
  p99: ......................................................................... 1130.2
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 20291.9
  max: ......................................................................... 21336.1
  median: ...................................................................... 20958.1
  p95: ......................................................................... 21381.5
  p99: ......................................................................... 21381.5